Revit 2027 API
BuiltInFailures.ConnectorFailures.RemoveConnectorLinksWarn Property
 The links between connector [Index] and connector [Index], connector [Index] and connector [Index] are removed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RemoveConnectorLinksWarn { get; }
Public Shared ReadOnly Property RemoveConnectorLinksWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RemoveConnectorLinksWarn {
	FailureDefinitionId^ get ();
}
static member RemoveConnectorLinksWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace